app/Controllers/Login.php

    public function index()
    {
        $userModel = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'kevin'
 LIMIT 1