app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
ORDER BY `id` ASC
---
    public function index()
    {
        $model = new MahasiswaModel();

        return $this->respond([
            'statusCode' => 200,
            'message' => 'OK',
            'data' => $model->orderBy('id', 'ASC')->findAll()

SELECT *
FROM `mahasiswa`
WHERE `id` = '2'
 LIMIT 1
---
    public function show($id)
    {
        $model = new MahasiswaModel();
        $data = $model->where('id', $id)->first();