app/Controllers/Register.php

INSERT INTO `users` (`username`, `password`) VALUES ('kevin', '$2y$10$vGXnUTth2qx7B4BxI9vi6.0hKU6rFARje8P8OdJKm414bBdff/wAy')
---
    public function index()
    {
        $rules = [
            'username' => ['rules' => 'required|min_length[4]|max_length[100]|is_unique[users.username]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[200]'],
            'confirm_password' => ['label' => 'confirm password', 'rules' => 'matches[password]']
        ];

        if ($this->validate($rules)) {
            $model = new UserModel();
            $data = [
                'username' => $this->request->getVar('username'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);